lbarbisch/Knobber/Software/Knobber_STM32/Core/Src/application.c
/*
 * application.c
 *
 *  Created on: Mar 25, 2024
 *      Author: Lukas
 */

#include "application.h"
#include "stm32l4xx_hal.h"
#include "usbd_hid.h"

extern UART_HandleTypeDef huart1;
extern TIM_HandleTypeDef htim1;
extern ADC_HandleTypeDef hadc1;
extern I2C_HandleTypeDef hi2c2;
extern USBD_HandleTypeDef hUsbDeviceFS;

typedef struct
{
	uint8_t button;
	int8_t mouse_x;
	int8_t mouse_y;
	int8_t wheel;
} mouseHID;

typedef enum
{
    INDENT_64,
    INDENT_32,
    INDENT_16,
	INDENT_8,
	INDENT_4,
	INDENT_1
} States;

mouseHID mousehid = {0,0,0,0};

States currentState = INDENT_32;

float voltage = 0;
extern Controller moco;

uint8_t rxbuf[64] = {0};
uint8_t rxchar;
uint8_t rxbuf_index = 0;

uint16_t adc_dma_results[5];
uint16_t adc_curr_idle[3];
float current[3];

uint8_t task = 0;
uint8_t ran = 0;
uint32_t ran_ticks = 50;

int32_t old_position;

void init()
{
	setMode(POSITION_MODE);

	HAL_ADC_Start_DMA(&hadc1, (uint32_t *) adc_dma_results, 5);

	HAL_Delay(50);
	adc_curr_idle[0] = adc_dma_results[0];
	adc_curr_idle[1] = adc_dma_results[1];
	adc_curr_idle[2] = adc_dma_results[2];


	enableMotor();

	initMotorControl();

	moco.mode = INDENT_MODE;

	if (moco.position > 2048/2)
	{
		moco.position += 2048;
	}
}

//uint16_t indents = 36;
int32_t dings = 0;
uint8_t oldButtonState = 0;

void mainloop()
{
	update();
	//continuousIndents(indents);

	switch (currentState)
	{
	case INDENT_64:
		continuousIndents(64);
		break;
	case INDENT_32:
		continuousIndents(32);
		break;
	case INDENT_16:
		continuousIndents(16);
		break;
	case INDENT_8:
		continuousIndents(8);
		break;
	case INDENT_4:
		continuousIndents(4);
		break;
	case INDENT_1:
		continuousIndents(1);
		break;
	}

	if (dings != moco.indent_increments)
	{
		mousehid.wheel = (moco.indent_increments-dings)*2;
		USBD_HID_SendReport(&hUsbDeviceFS, &mousehid, sizeof (mousehid));
		mousehid.wheel = 0;
		dings = moco.indent_increments;
	}

	// next state logic
	if ((HAL_GPIO_ReadPin(Button_GPIO_Port, Button_Pin) == 1) && oldButtonState == 0)
	{
		HAL_Delay(20);
		if (HAL_GPIO_ReadPin(Button_GPIO_Port, Button_Pin))
		{
			switch (currentState)
			{
			case INDENT_64:
				currentState = INDENT_32;
				break;
			case INDENT_32:
				currentState = INDENT_16;
				break;
			case INDENT_16:
				currentState = INDENT_8;
				break;
			case INDENT_8:
				currentState = INDENT_4;
				break;
			case INDENT_4:
				currentState = INDENT_1;
				break;
			case INDENT_1:
				currentState = INDENT_64;
				break;
			default:
				break;
			}
		}
	}
	oldButtonState = HAL_GPIO_ReadPin(Button_GPIO_Port, Button_Pin);
}

float getSupplyVoltage()
{
	return voltage;
}

void getPhaseCurrents(float* _current)
{
	_current[0] = _current[0] * 0.9 + 0.1 * ((float)adc_dma_results[0] - (float)adc_curr_idle[0]) * 0.64453125f;
	_current[1] = _current[1] * 0.9 + 0.1 * ((float)adc_dma_results[1] - (float)adc_curr_idle[1]) * 0.64453125f;
	_current[2] = _current[2] * 0.9 + 0.1 * ((float)adc_dma_results[2] - (float)adc_curr_idle[2]) * 0.64453125f;
}

void HAL_UART_RxCpltCallback(UART_HandleTypeDef *huart)
{
	__HAL_UART_CLEAR_FLAG(huart, 0xFF);
	if(rxbuf_index < 20)
	{
		rxbuf[rxbuf_index] = rxchar;
		rxbuf_index++;
	}
	else rxbuf_index = 0;
	if ((rxchar == '\r') || (rxchar == '\n'))
	{
		rxbuf[rxbuf_index] = 0;
		if (rxbuf_index > 1)
		{
			parseCommandandUpdate(rxbuf, rxbuf_index);
		}
		rxbuf_index = 0;
	}
}


void parseCommandandUpdate(uint8_t* buffer, uint8_t index)
{
	unsigned int _direction = 0;
	unsigned int _power = 0;
	signed int _target = 0;
	signed int _position = 0;
	unsigned int _red = 0;
	unsigned int _green = 0;
	unsigned int _blue = 0;

	switch (buffer[0])
	{
		case 'T':
			if (sscanf((char*)buffer, "T%u_%u", &_direction, &_power) == 2)
			{
				uint8_t temp_direction = (uint8_t)_direction;
				uint8_t temp_power = (uint8_t)_power;
				setMode(TORQUE_MODE);
				setDirection(temp_direction);
				setPower(temp_power);
			}
			break;
		case 'P':
			if (sscanf((char *)buffer, "P%d_%u", &_target, &_power) == 2)
			{
				uint32_t temp_target = (uint32_t)_target;
				uint8_t temp_power = (uint8_t)_power;
				setMode(POSITION_MODE);
				setTarget(temp_target);
				setPower(temp_power);
			}
			break;
		case 'C':
			if (sscanf((char *)buffer, "C%u_%u_%u", &_red, &_green, &_blue) == 3)
			{
				uint8_t red = (uint8_t)_red;
				uint8_t green = (uint8_t)_green;
				uint8_t blue = (uint8_t)_blue;
				setColor(red, green, blue, 31);
			}
			break;
		case 'G':
			if (buffer[1] == '?')
			{
				char txbuf[32] = {0};
				_power = (unsigned int)getPower();
				_position = (signed int)getPosition();
				sprintf(txbuf, "%u_%d\n", _power, _position);
				HAL_UART_Transmit(&huart1, (uint8_t *)txbuf, (uint16_t)strlen(txbuf), 50);
			}
			break;
		case '*':
			// Special SCPI commands
			if (buffer[1] == 'I')
			{
				if (buffer[2] == 'D')
				{
					if (buffer[3] == 'N')
					{
						if (buffer[4] == '?')
						{
							char txbuf[] = "Knobber\n";
							HAL_UART_Transmit(&huart1, (uint8_t *)txbuf, (uint16_t)strlen(txbuf), 50);
						}
					}
				}
			}
			break;
		default:
			break;
	}
}

